MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAH169/mcu.h
#define _ABF1DEVCFG0_POSCFGAIN_POSITION          0x00000016
#define _ABF1DEVCFG0_POSCFGAIN_MASK              0x00C00000
#define _ABF1DEVCFG0_POSCFGAIN_LENGTH            0x00000002

#define _ABF1DEVCFG0_POSCTYPE_POSITION           0x00000018
#define _ABF1DEVCFG0_POSCTYPE_MASK               0x03000000
#define _ABF1DEVCFG0_POSCTYPE_LENGTH             0x00000002

#define _ABF1DEVCFG0_POSCAGCRNG_POSITION         0x0000001A
#define _ABF1DEVCFG0_POSCAGCRNG_MASK             0x04000000
#define _ABF1DEVCFG0_POSCAGCRNG_LENGTH           0x00000001

#define _ABF1DEVCFG0_POSCAGC_POSITION            0x0000001B
#define _ABF1DEVCFG0_POSCAGC_MASK                0x08000000
#define _ABF1DEVCFG0_POSCAGC_LENGTH              0x00000001

#define _ABF1DEVCFG0_EJTAGBEN_POSITION           0x0000001E
#define _ABF1DEVCFG0_EJTAGBEN_MASK               0x40000000
#define _ABF1DEVCFG0_EJTAGBEN_LENGTH             0x00000001

#define _ABF1DEVCFG0_POSCAGCDLY_POSITION         0x00000018
#define _ABF1DEVCFG0_POSCAGCDLY_MASK             0x03000000
#define _ABF1DEVCFG0_POSCAGCDLY_LENGTH           0x00000002

#define _ABF1DEVCFG0_FDEBUG_POSITION             0x00000000
#define _ABF1DEVCFG0_FDEBUG_MASK                 0x00000003
#define _ABF1DEVCFG0_FDEBUG_LENGTH               0x00000002

#define _ABF1DEVCFG0_w_POSITION                  0x00000000
#define _ABF1DEVCFG0_w_MASK                      0xFFFFFFFF
#define _ABF1DEVCFG0_w_LENGTH                    0x00000020

#define _ABF1DEVCP0_CP_POSITION                  0x0000001C
#define _ABF1DEVCP0_CP_MASK                      0x10000000
#define _ABF1DEVCP0_CP_LENGTH                    0x00000001

#define _ABF1DEVCP0_w_POSITION                   0x00000000
#define _ABF1DEVCP0_w_MASK                       0xFFFFFFFF
#define _ABF1DEVCP0_w_LENGTH                     0x00000020

#define _ABF1SEQ3_TSEQ_POSITION                  0x00000000
#define _ABF1SEQ3_TSEQ_MASK                      0x0000FFFF
#define _ABF1SEQ3_TSEQ_LENGTH                    0x00000010

#define _ABF1SEQ3_CSEQ_POSITION                  0x00000010
#define _ABF1SEQ3_CSEQ_MASK                      0xFFFF0000
#define _ABF1SEQ3_CSEQ_LENGTH                    0x00000010

#define _ABF1SEQ3_w_POSITION                     0x00000000
#define _ABF1SEQ3_w_MASK                         0xFFFFFFFF
#define _ABF1SEQ3_w_LENGTH                       0x00000020

#define _BF1DEVCFG4_SWDTPS_POSITION              0x00000018
#define _BF1DEVCFG4_SWDTPS_MASK                  0x1F000000
#define _BF1DEVCFG4_SWDTPS_LENGTH                0x00000005

#define _BF1DEVCFG4_w_POSITION                   0x00000000
#define _BF1DEVCFG4_w_MASK                       0xFFFFFFFF
#define _BF1DEVCFG4_w_LENGTH                     0x00000020

#define _BF1DEVCFG3_USERID_POSITION              0x00000000
#define _BF1DEVCFG3_USERID_MASK                  0x0000FFFF
#define _BF1DEVCFG3_USERID_LENGTH                0x00000010

#define _BF1DEVCFG3_EXTDDRSIZE_POSITION          0x00000010
#define _BF1DEVCFG3_EXTDDRSIZE_MASK              0x000F0000
#define _BF1DEVCFG3_EXTDDRSIZE_LENGTH            0x00000004

#define _BF1DEVCFG3_FMIIEN_POSITION              0x00000018
#define _BF1DEVCFG3_FMIIEN_MASK                  0x01000000
#define _BF1DEVCFG3_FMIIEN_LENGTH                0x00000001

#define _BF1DEVCFG3_FETHIO_POSITION              0x00000019
#define _BF1DEVCFG3_FETHIO_MASK                  0x02000000
#define _BF1DEVCFG3_FETHIO_LENGTH                0x00000001

#define _BF1DEVCFG3_PGL1WAY_POSITION             0x0000001B
#define _BF1DEVCFG3_PGL1WAY_MASK                 0x08000000
#define _BF1DEVCFG3_PGL1WAY_LENGTH               0x00000001

#define _BF1DEVCFG3_PMDL1WAY_POSITION            0x0000001C
#define _BF1DEVCFG3_PMDL1WAY_MASK                0x10000000
#define _BF1DEVCFG3_PMDL1WAY_LENGTH              0x00000001

#define _BF1DEVCFG3_IOL1WAY_POSITION             0x0000001D
#define _BF1DEVCFG3_IOL1WAY_MASK                 0x20000000
#define _BF1DEVCFG3_IOL1WAY_LENGTH               0x00000001

#define _BF1DEVCFG3_w_POSITION                   0x00000000
#define _BF1DEVCFG3_w_MASK                       0xFFFFFFFF
#define _BF1DEVCFG3_w_LENGTH                     0x00000020

#define _BF1DEVCFG2_FPLLIDIV_POSITION            0x00000000
#define _BF1DEVCFG2_FPLLIDIV_MASK                0x00000007
#define _BF1DEVCFG2_FPLLIDIV_LENGTH              0x00000003

#define _BF1DEVCFG2_FPLLRNG_POSITION             0x00000004
#define _BF1DEVCFG2_FPLLRNG_MASK                 0x00000070
#define _BF1DEVCFG2_FPLLRNG_LENGTH               0x00000003

#define _BF1DEVCFG2_FPLLICLK_POSITION            0x00000007
#define _BF1DEVCFG2_FPLLICLK_MASK                0x00000080
#define _BF1DEVCFG2_FPLLICLK_LENGTH              0x00000001

#define _BF1DEVCFG2_FPLLMULT_POSITION            0x00000008
#define _BF1DEVCFG2_FPLLMULT_MASK                0x00007F00
#define _BF1DEVCFG2_FPLLMULT_LENGTH              0x00000007

#define _BF1DEVCFG2_FPLLODIV_POSITION            0x00000010
#define _BF1DEVCFG2_FPLLODIV_MASK                0x00070000
#define _BF1DEVCFG2_FPLLODIV_LENGTH              0x00000003

#define _BF1DEVCFG2_VBATBOREN_POSITION           0x00000013
#define _BF1DEVCFG2_VBATBOREN_MASK               0x00080000
#define _BF1DEVCFG2_VBATBOREN_LENGTH             0x00000001

#define _BF1DEVCFG2_DSBOREN_POSITION             0x00000014
#define _BF1DEVCFG2_DSBOREN_MASK                 0x00100000
#define _BF1DEVCFG2_DSBOREN_LENGTH               0x00000001

#define _BF1DEVCFG2_DSWDTPS_POSITION             0x00000015
#define _BF1DEVCFG2_DSWDTPS_MASK                 0x03E00000
#define _BF1DEVCFG2_DSWDTPS_LENGTH               0x00000005

#define _BF1DEVCFG2_DSWDTOSC_POSITION            0x0000001A
#define _BF1DEVCFG2_DSWDTOSC_MASK                0x04000000
#define _BF1DEVCFG2_DSWDTOSC_LENGTH              0x00000001

#define _BF1DEVCFG2_DSWDTEN_POSITION             0x0000001B
#define _BF1DEVCFG2_DSWDTEN_MASK                 0x08000000
#define _BF1DEVCFG2_DSWDTEN_LENGTH               0x00000001

#define _BF1DEVCFG2_FDSEN_POSITION               0x0000001C
#define _BF1DEVCFG2_FDSEN_MASK                   0x10000000
#define _BF1DEVCFG2_FDSEN_LENGTH                 0x00000001

#define _BF1DEVCFG2_UPLLFSEL_POSITION            0x0000001E
#define _BF1DEVCFG2_UPLLFSEL_MASK                0x40000000
#define _BF1DEVCFG2_UPLLFSEL_LENGTH              0x00000001

#define _BF1DEVCFG2_w_POSITION                   0x00000000
#define _BF1DEVCFG2_w_MASK                       0xFFFFFFFF
#define _BF1DEVCFG2_w_LENGTH                     0x00000020

